import "../App.css";
import RecBox from "./recBox";
import "./recSec.css";
function RecSec() {
  return (
    <div className="RecSecDiv">
      <RecBox
        RevText="”סיון מלווה אותי עוד שהתחלתי להתנדב בצבא ואפילו קצת לפני. היא עזרה לי להבין יותר את הסביבה ולענות בצורה מותאמת.

למדתי ממנה כיצד להתמודד עם ריבוי משימות ולעבוד על הלחץ שלי שלא ישפיע ויפרק לי את כל היום.

השיחה איתה עוזרת לי להבין את היחסים שלי מול המשפחה לי ומול החברים. אני יודע להתמודד עם הרבה יותר דברים היום בצורה מאוזנת. “"
        RevName="בוגר בן 23"
      />
      <RecBox
        RevText="”סיון הגיעה להעביר לנו הרצאה בנושא אוטיזם לעובדים שלנו שיש להם ילדים עם אוטיזם. היא נתנה כלים פרקטיים וענתה לכל השאלות שעלו בסבלנות רבה.

ההורים כל כך שמחו על קיום המפגש והיכולות שלנו כחברה לתת להם מענה ולהכיר בקשיים שהם מתמודדים איתם. סיון יצרה מקום בטוח במהלך ההרצאה שנתן אפשרות להיחשף ולהרגיש חלק מקהילה.

מודה לה על ההרצאה המחברת והמגשרת עבורנו. “"
        RevName="רכזת משאבי אנוש חברת ביטוח"
      />
    </div>
  );
}

export default RecSec;
