import { useState } from "react";
import "../App.css";
import RecBox from "./recBox";
import "./recSec.css";
function RecSec() {
  const [startIndex, setStartIndex] = useState(0);

  const handleNext = () => {
    setStartIndex((prev) => (prev + 2 < reviews.length ? prev + 2 : 0));
  };
  const reviews = [
    {
      RevText:
        "”סיון מלווה אותי עוד שהתחלתי להתנדב בצבא ואפילו קצת לפני. היא עזרה לי להבין יותר את הסביבה ולענות בצורה מותאמת.\n\nלמדתי ממנה כיצד להתמודד עם ריבוי משימות ולעבוד על הלחץ שלי שלא ישפיע ויפרק לי את כל היום.\n\nהשיחה איתה עוזרת לי להבין את היחסים שלי מול המשפחה לי ומול החברים. אני יודע להתמודד עם הרבה יותר דברים היום בצורה מאוזנת. “",
      RevName: "בוגר בן 23",
    },
    {
      RevText:
        "”סיון הגיעה להעביר לנו הרצאה בנושא אוטיזם לעובדים שלנו שיש להם ילדים עם אוטיזם. היא נתנה כלים פרקטיים וענתה לכל השאלות שעלו בסבלנות רבה.\n\nההורים כל כך שמחו על קיום המפגש והיכולות שלנו כחברה לתת להם מענה ולהכיר בקשיים שהם מתמודדים איתם. סיון יצרה מקום בטוח במהלך ההרצאה שנתן אפשרות להיחשף ולהרגיש חלק מקהילה.\n\nמודה לה על ההרצאה המחברת והמגשרת עבורנו. “",
      RevName: "רכזת משאבי אנוש חברת ביטוח",
    },
    //from here it's demo
    {
      RevText:
        "”סיון הגיעה להעביר לנו הרצאה בנושא אוטיזם לעובדים שלנו שיש להם ילדים עם אוטיזם. היא נתנה כלים פרקטיים וענתה לכל השאלות שעלו בסבלנות רבה.\n\nההורים כל כך שמחו על קיום המפגש והיכולות שלנו כחברה לתת להם מענה ולהכיר בקשיים שהם מתמודדים איתם. סיון יצרה מקום בטוח במהלך ההרצאה שנתן אפשרות להיחשף ולהרגיש חלק מקהילה.\n\nמודה לה על ההרצאה המחברת והמגשרת עבורנו. “",
      RevName: "רכזת משאבי אנוש חברת ביטוח",
    },
    {
      RevText:
        "”סיון הגיעה להעביר לנו הרצאה בנושא אוטיזם לעובדים שלנו שיש להם ילדים עם אוטיזם. היא נתנה כלים פרקטיים וענתה לכל השאלות שעלו בסבלנות רבה.\n\nההורים כל כך שמחו על קיום המפגש והיכולות שלנו כחברה לתת להם מענה ולהכיר בקשיים שהם מתמודדים איתם. סיון יצרה מקום בטוח במהלך ההרצאה שנתן אפשרות להיחשף ולהרגיש חלק מקהילה.\n\nמודה לה על ההרצאה המחברת והמגשרת עבורנו. “",
      RevName: "רכזת משאבי אנוש חברת ביטוח",
    },
    {
      RevText:
        "”סיון הגיעה להעביר לנו הרצאה בנושא אוטיזם לעובדים שלנו שיש להם ילדים עם אוטיזם. היא נתנה כלים פרקטיים וענתה לכל השאלות שעלו בסבלנות רבה.\n\nההורים כל כך שמחו על קיום המפגש והיכולות שלנו כחברה לתת להם מענה ולהכיר בקשיים שהם מתמודדים איתם. סיון יצרה מקום בטוח במהלך ההרצאה שנתן אפשרות להיחשף ולהרגיש חלק מקהילה.\n\nמודה לה על ההרצאה המחברת והמגשרת עבורנו. “",
      RevName: "רכזת משאבי אנוש חברת ביטוח",
    },
    {
      RevText:
        "”סיון הגיעה להעביר לנו הרצאה בנושא אוטיזם לעובדים שלנו שיש להם ילדים עם אוטיזם. היא נתנה כלים פרקטיים וענתה לכל השאלות שעלו בסבלנות רבה.\n\nההורים כל כך שמחו על קיום המפגש והיכולות שלנו כחברה לתת להם מענה ולהכיר בקשיים שהם מתמודדים איתם. סיון יצרה מקום בטוח במהלך ההרצאה שנתן אפשרות להיחשף ולהרגיש חלק מקהילה.\n\nמודה לה על ההרצאה המחברת והמגשרת עבורנו. “",
      RevName: "רכזת משאבי אנוש חברת ביטוח",
    },
    // TODO add a small animation & style the button (maybe make it auto swtich)
  ];

  return (
    <div className="RecSecDiv">
      {reviews.slice(startIndex, startIndex + 2).map((review, index) => (
        <RecBox key={startIndex + index} {...review} />
      ))}

      <button onClick={handleNext}>Next</button>
    </div>
  );
}

export default RecSec;
