import "../App.css";
import RecBox from "./recBox";
import "./recSec.css";
function RecSec() {
  return (
    <div className="RecSecDiv">
      <RecBox
        RevText="”סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם.“"
        RevName="-אנונימית"
      />
      <RecBox
        RevText="”סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם.“"
        RevName="-אנונימית"
      />

      <RecBox
        RevText="”סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם.“"
        RevName="-אנונימית"
      />
      <RecBox
        RevText="”סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם.“"
        RevName="-אנונימית"
      />
      <RecBox
        RevText="”סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם.“"
        RevName="-אנונימית"
      />
      <RecBox
        RevText="”סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם. סיון עזרה לבני מאוד, בזכותה הוא התקדם.“"
        RevName="-אנונימית"
      />
    </div>
  );
}

export default RecSec;
